tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.org/ice/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0.0001/ice";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 260;

boundaryField
{
    symmetry
    {
        type            symmetryPlane;
    }
    walls
    {
        type            zeroGradient;
    }
    ice_to_cabin
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 260;
        Tnbr            T;
        kappa           fluidThermo;
        kappaName       none;
    }
    ice_to_exterior
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 260;
        Tnbr            T;
        kappa           fluidThermo;
        kappaName       none;
    }
}


// ************************************************************************* //
